loadtesting/artillery.yml
config:
  target: 'http://localhost:3002'
  phases:
    - duration: 60
      arrivalRate: 3000
  # defaults:
    # headers:
      # x-my-service-auth: '987401838271002188298567'
scenarios:
  - flow:
    - get:
        url: "/songs/100100"
    # - get:
    #     url: "/relatedAlbums/100100"
    # - get:
    #     url: "/relatedTracks/100100"